tap "arkweid/lefthook"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "twpayne/taps"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# The Haskell Tool Stack
brew "haskell-stack"
# Command-line accounting tool
brew "hledger"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql", restart_service: true
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Internet file retriever
brew "wget"
# The next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Lefthook a single dependency-free binary to manage all your git hooks that works with any language in any environment, and in all common team workflows
brew "arkweid/lefthook/lefthook"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", args: ["without-spacemacs-icon"]
# Manage your dotfiles across multiple machines, securely.
brew "twpayne/taps/chezmoi"
cask "1password"
cask "brave-browser"
cask "brewservicesmenubar"
cask "caffeine"
cask "dash"
cask "deezer"
cask "docker"
cask "font-firacode-nerd-font"
cask "font-iosevka-nerd-font"
cask "gog-galaxy"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "java"
cask "postico"
cask "skype"
cask "slack"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
mas "Debit & Credit", id: 882637653
mas "Logic Pro X", id: 634148309
mas "Numbers", id: 409203825
mas "Pixelmator", id: 407963104
mas "Things", id: 904280696
