tap "arkweid/lefthook"
tap "borkdude/brew"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
# Apache ActiveMQ: powerful open source messaging server
brew "activemq", restart_service: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Language Server Protocol (LSP) server for Dhall
brew "dhall-lsp-server"
# Convert between Dhall and YAML
brew "dhall-yaml"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# The Haskell Tool Stack
brew "haskell-stack"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Build tool for Clojure
brew "leiningen"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql", restart_service: true
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# The next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Lefthook a single dependency-free binary to manage all your git hooks that works with any language in any environment, and in all common team workflows
brew "arkweid/lefthook/lefthook"
# A minimal and opinionated linter for Clojure code that sparks joy.
brew "borkdude/brew/clj-kondo"
# The Clojure Programming Language
brew "clojure/tools/clojure"
brew "d12frosted/emacs-plus/emacs-plus@27"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
cask "1password"
cask "ableton-live"
cask "balenaetcher"
cask "bitbar"
cask "brave-browser"
cask "caffeine"
cask "dash"
cask "deezer"
cask "discord"
cask "docker"
cask "firefox"
cask "font-cascadia-pl"
cask "gog-galaxy"
cask "google-chrome"
cask "gpg-suite"
cask "grammarly"
cask "iterm2"
cask "java"
cask "notion"
cask "plex-media-server"
cask "postico"
cask "postman"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram"
cask "transmission"
cask "unetbootin"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Things", id: 904280696
