tap "arkweid/lefthook"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "twpayne/taps"
brew "elixir"
brew "exa"
brew "git"
brew "haskell-stack"
brew "hledger"
brew "mas"
brew "node"
brew "postgresql", restart_service: true
brew "rbenv"
brew "ripgrep"
brew "terminal-notifier"
brew "vim"
brew "wget"
brew "zplug"
brew "zsh"
brew "arkweid/lefthook/lefthook"
brew "twpayne/taps/chezmoi"
cask "brewservicesmenubar"
cask "dash"
cask "deezer"
cask "docker"
cask "font-firacode-nerd-font"
cask "google-chrome"
cask "gpg-suite"
cask "postico"
cask "skype"
cask "slack"
cask "telegram"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "railwaycat/emacsmacport/emacs-mac"
mas "Logic Pro X", id: 634148309
mas "Numbers", id: 409203825
mas "Pixelmator", id: 407963104
